Repository: lucasew/ritm_annotation
Catalog: ritm_annotation/i18n/*/LC_MESSAGES/ritm_annotation.po
Languages: pt_br

source: Multi-stage models support only NoBRS mode.
pt_br: Modelos multi estágio suportam apenas o modo NoBRS.

source: Eval results for model: {model_name}
pt_br: Resultados da avaliação para o modelo: {model_name}

source: Warning
pt_br: Aviso

source: A segmentation mask must have the same sizes as the current image!
pt_br: A máscara de segmentação precisa ter os mesmos tamanhos da imagem atual!

source: Incorrect value in input field
pt_br: Valor incorreto no campo de entrada

source: Value for {name} should be in [{mn}; {mx}] and of type {vartype}
pt_br: Valor para {name} deve ser entre [{mn}; {mx}] e do tipo {vartype}

source: Cannot use pack with the widget {name}
pt_br: Não é possível usar pack com o widget de nome {name}

source: Cannot use place with the widget {name}
pt_br: Não é possível usar place com o widget {name}

source: Reviving Iterative Training with Mask Guidance for Interactive Segmentation
pt_br: Revivendo Treino Iterativo com Mascaramento Guiado para Segmentação Interativa

source: Class finished
pt_br: Classe finalizada

source: The class '{class_name}' was finalized
pt_br: A classe '{class_name}' foi finalizada

source: * no one *
pt_br: * nenhum *

source: Pulling next task from the iterator
pt_br: Puxando a próxima tarefa do iterador

source: Load image
pt_br: Carregar imagem

source: Save mask
pt_br: Salvar máscara

source: Previous image
pt_br: Imagem anterior

source: Load mask
pt_br: Carregar máscara

source: About
pt_br: Sobre

source: Exit
pt_br: Sair

source: * status *
pt_br: * estado *

source: Controls
pt_br: Controles

source: Clicks management
pt_br: Gerenciamento de cliques

source: Finish object
pt_br: Finalizar objeto

source: ZoomIn options
pt_br: Opções de aproximação

source: Use ZoomIn
pt_br: Usar aproximação

source: Fixed crop
pt_br: Corte fixo

source: Skip clicks
pt_br: Pular cliques

source: Target size
pt_br: Tamanho alvo

source: Expand ratio
pt_br: Razão de expansão

source: BRS options
pt_br: Opções de BRS

source: Network clicks
pt_br: Cliques da rede

source: L-BFGS max iterations
pt_br: L-BFGS iterações máximas

source: Predictions threshold
pt_br: Limiar de predições

source: Alpha blending coefficient
pt_br: Coeficiente de mistura de alfa

source: Visualisation click radius
pt_br: Raio do ponto de clique

source: Loading '{filename}'
pt_br: Carregando '{filename}'

source: Saving '{filename}'
pt_br: Salvando '{filename}'

source: The current model doesn't support loading external masks. Please use ITER-M models for that purpose.
pt_br: O modelo atual não suporta o carregamento de máscaras externas. Por favor use modelos ITER-M para isso.

source: Developed by:
pt_br: Desenvolvido por:

source: About Demo
pt_br: Sobre a Demo

source: Please load an image first
pt_br: Por favor carregue uma imagem primeiro

source: Interactively annotate a dataset
pt_br: Anotador interativo de dataset

source: CUDA support not detected. Stuff will be way slower and sluggish!
pt_br: Suporte a CUDA não detectado. As coisas funcionarão muito mais lentas e travadas!

source: Folder with pre-defined segmentations to be adjusted
pt_br: Pasta com segmentações pré-definidas para serem ajustadas

source: Origin should be a folder
pt_br: Origem precisa ser uma pasta

source: Destination should be a folder, if it isn't exist it will be created
pt_br: Destino precisa ser uma pasta, se não existe ela será criada

source: Checkpoint not specified, using default...
pt_br: Checkpoint não especificado, usando o padrão...

source: Looks for common problems in datasets in mask form that are used for finetuning and generated by the annotator
pt_br: Procura por problemas comuns em datasets no formato de máscara que são usados para fazer ajuste fino e gerados pelo anotador

source: Folder where the ground truths/masks are stored
pt_br: Pasta onde as máscaras são salvas

source: Folder where the dataset images are stored
pt_br: Pasta onde as iamgens são salvas

source: How many concurrent checks
pt_br: Quantas checagens concorrentes

source: Dataset must be a directory
pt_br: Dataset deve ser uma pasta

source: Invalid image directory
pt_br: Pasta de imagem inválida

source: Using images with masks!
pt_br: Usando imagens com máscaras!

source: '{item}': Dataset noise
pt_br: '{item}': Ruído de dataset

source: '{image_file}': Image file doesn't exist
pt_br: '{image_file}': Arquivo de imagem não existe

source: '{item_img}': Invalid image
pt_br: '{item_img}': Imagem inválida

source: '{mask}': Invalid mask
pt_br: '{mask}': Máscara inválida

source: '{mask}': First dimension doesn't match for image and mask
pt_br: '{mask}': Primeira dimensão não é igual para imagem e máscara

source: '{mask}': Second dimension doesn't match for image and mask
pt_br: '{mask}': Segunda dimensão não é igual para imagem e máscara

source: Convert dataset in mask form to COCO
pt_br: Converter dataset em forma de máscara para COCO

source: Dataset folder in mask form
pt_br: Diretório do dataset em forma de máscara

source: Where to save the COCO dataset JSON
pt_br: Onde salvar o JSON do dataset COCO

source: Overwrite JSON file if it exists
pt_br: Sobrescrever o arquivo JSON se existir

source: Description for the COCO dataset
pt_br: Descrição do dataset COCO

source: Created with ritm_annotation
pt_br: Criado com ritm_annotation

source: Dataset folder must exist and be a folder
pt_br: O diretório do dataset precisa existir e ser um diretório

source: COCO dataset exists, use --overwrite to ignore this
pt_br: O dataset COCO existe, use --overwrite para ignorar isso

source: Enumerating all classes...
pt_br: Enumerando todas as classes...

source: Ingesting images...
pt_br: Ingerindo imagens...

source: Run from-scratch trains using off the shelf datasets
pt_br: Executa treinos do zero usando datasets de prateleira

source: Path to the model script.
pt_br: Caminho até o script de modelo.

source: Where to store experiment data
pt_br: Onde guardar dados de experimento

source: Amount of epochs
pt_br: Número de épocas

source: Here you can specify the name of the experiment. It will be added as a suffix to the experiment folder.
pt_br: Aqui você pode especificar o nome do experimento. Ele será adicionado como um sufixo na pasta do experimento.

source: Dataloader threads.
pt_br: Threads do DataLoader

source: You can override model batch size by specify positive number.
pt_br: Você pode alterar o valor padrão de batch size do modelo ao especificar um valor positivo.

source: Number of GPUs. If you only specify "--gpus" argument, the ngpus value will be calculated automatically. You should use either this argument or "--gpus".
pt_br: Número de GPUs. Se você apenas especificar o argumento "--gpus", o valor de ngpus vai ser calculado automaticamente. Você deve ou usar este argumento ou "--gpus".

source: Ids of used GPUs. You should use either this argument or "--ngpus".
pt_br: Ids das GPUs usadas. Você deve ou usar este argumento ou "--ngpus".

source: The prefix of the name of the experiment to be continued. If you use this field, you must specify the "--resume-prefix" argument.
pt_br: O prefixo do nome do experimento a ser retomado. Se você definir este argumento você deve também definir o argumento "--resume-prefix"

source: The prefix of the name of the checkpoint to be loaded.
pt_br: O prefixo do nome do checkpoint a ser carregado.

source: The number of the starting epoch from which training will continue. (it is important for correct logging and learning rate)
pt_br: O número da época inicial que o treinamento vai iniciar (é importante para geração correta dos relatórios e cálculo do learning rate)

source: Model weights will be loaded from the specified path if you use this argument.
pt_br: Pesos serão carregados do seguinte caminho se você usar este argumento.

source: Do not use this argument (for internal purposes).
pt_br: Não use este argumento (uso interno).

source: Falling back to temp_model_path because model_path wasn't specified
pt_br: Passando a usar temp_model_path porque model_path não foi especificado

source: Final model path: '{model_path}'
pt_br: Não é possível importar o módulo em '{module_path}'

source: Basic validations passed
pt_br: Dataset de validação em falta

source: Run finetune trains using a dataset in the format the annotator generates
pt_br: Executa treinos de ajuste fino usando um dataset no formato que o anotador gera.

source: Path to the dataset images.
pt_br: Caminho para as imagens do dataset.

source: Path to the dataset masks.
pt_br: Caminho para as máscaras do dataset.

source: Resize the input dataset so the bigger dimension is this value
pt_br: Redimensionar o dataset de entrada para que a maior dimensão tenha o seguinte valor

source: AnnotationDataset: found impurities: {item}
pt_br: AnnotationDataset: impurezas encontradas: {item}

source: Found mask for {item_name} but not image
pt_br: Encontrada máscara para {item_name} sem a imagem

source: split must be either train or val
pt_br: split precisa ser ou train ou val

source: Processed item {index}: '{item}' (shape: ({w}, {h})
pt_br: Processado item {index}: '{item}' (shape: ({w}, {h})

source: Give more details about what is happening
pt_br: Dar mais detalhes sobre o que está acontecendo

source: Print version and exit
pt_br: Exibir versão e sair

source: Show information about a model pth file
pt_br: Mostrar informação sobre um arquivo de modelo pth

source: Loading model
pt_br: Inicializando modelo

source: Model must exist and be a file
pt_br: Modelo precisa existir e ser um arquivo

source: Loading locale data from "{locale_folder}"
pt_br: Carregando dados de internacionalização da pasta "{locale_folder}"

source: Models can only be located in the "models" directory in the root of the repository
pt_br: Modelos podem só ser carregados da pasta "models" na raiz do repositório

source: Number of GPUs: {n}
pt_br: Números de GPUs: {n}

source: Multi-Process Multi-GPU Distributed Training
pt_br: Treinamento Distribuido Multi-Processo Multi-GPU

source: No experiments could be found that satisfies the pattern = "{exp_pattern}"
pt_br: Nenhum experimento pode ser encontrado que satisfaça o padrão "{exp_pattern}"

source: Candidates: {candidates}
pt_br: Candidatos: {candidates}

source: More than one experiment found:
pt_br: Mais de um experimento foi encontrado:

source: Continue with experiment "{exp_path}"
pt_br: Continuar com o experimento "{exp_path}"

source: Changing configuration entry from environment variable: {k}={v}
pt_br: Mudando entrada de configuração a partir de variável de ambiente: {k}={v}

source: Save checkpoint to {checkpoint_path}
pt_br: Salvando checkpoint para {checkpoint_path}

source: Loading module '{module_path}'...
pt_br: Carregando módulo '{module_path}'...

source: Can't import module at '{module_path}'
pt_br: Não é possível importar o módulo em '{module_path}'

source: Downloading
pt_br: Baixando

source: SHA256 of default model is {actual_hash}, expected {expected_hash}
pt_br: O SHA256 do modelo padrão é {actual_hash}, esperado {expected_hash}

source: Unknown activation type {activation}
pt_br: Tipo de ativação inválido {activation}

source: unknown backbone: {backbone}
pt_br: backbone desconhecido: {backbone}

source: File "{file}" does not exist.
pt_br: Arquivo "{file}" não existe.

source: You need to specify the correct path to the pre-trained weights. You can download the weights for HRNet from the repository: https://github.com/HRNet/HRNet-Image-Classification
pt_br: Você precisa especificar o caminho correto até os pesos pré-treinados. Você pode baixar os pesos para a HRNet do repositório: https://github.com/HRNet/HRNet-Image-Classification

source: => unknown dilation size: {dilation}
pt_br: => tamanho de dilation desconhecido: {dilation}

source: [ERROR] Failed to load <{k}> in backbone
pt_br: [ERRO] Falha ao carregar <{k}> no backbone

source: Incorrect factor type
pt_br: Fator de tipo incorreto

source: Unknown random type
pt_br: Tipo aleatório desconhecido

source: Looking for basic assumptions
pt_br: Testando as premissas básicas

source: Missing train dataset
pt_br: Dataset de treino em falta

source: Missing validation dataset
pt_br: Dataset de validação em falta

source: Dataset of {num_samples} samples was loaded for training.
pt_br: Dataset com {num_samples} elementos foi carregado apra treino.

source: Dataset of {num_samples} samples was loaded for validation.
pt_br: Dataset com {num_samples} elementos foi carregado para validação.

source: Setting up dataloder
pt_br: Configurando dataloader

source: Initializing model
pt_br: Inicializando modelo

source: Initializing click models
pt_br: Inicializando modelos de clique

source: First train batch: {batch}
pt_br: Primeiro batch de treino: {batch}

source: First evaluation batch: {batch}
pt_br: Primeiro batch de avaliação: {batch}

source: Run experiment with config:
pt_br: Execução do experimento com configuração:

source: Starting Epoch: {start_epoch}
pt_br: Iniciando época: {start_epoch}

source: Total Epochs: {num_epochs}
pt_br: Total de épocas: {num_epochs}

source: Epoch {epoch}, training loss {train_loss:.8f}
pt_br: Época {epoch}, loss de treinamento {train_loss:8f}

source: Epoch {epoch}, validation loss: {val_loss:.4f}
pt_br: Época {epoch}, loss de validação {val_loss:4f}

source: Saving epoch level losses
pt_br: Salvando losses da época

source: Saving epoch level metrics
pt_br: Salvando métricas da época

source: '{checkpoint_glob}' didn't match anything
pt_br: '{checkpoint_glob}' não captou nada

source: => no checkpoint found at '{weights_dir}'
pt_br: => sem checkpoint encontrado em '{weights_dir}'

source: Loading weights from path: '{path_to_weights}'
pt_br: Carregando pesos da pasta: '{path_to_weights}'

source: The number of datasets must match the number of ratios
pt_br: O número de datasets tem que bater com o número de ratios

source: The sum of ratios must be equal to 1
pt_br: A soma de ratios tem que ser igual a 1

source: Loaded {num_weights} weights with gamma={gamma}
pt_br: Carregados {num_weights} pesos com gamma={gamma}

source: Can't find annotations at {anno_path}
pt_br: Anotações não encontradas em {anno_path}

source: Remove the main function
pt_br: Remova a função main

source: usage:
pt_br: uso:

source: positional arguments
pt_br: argumentos posicionais

source: options
pt_br: opções

source: show this help message and exit
pt_br: Mostra esta mensagem de ajuda e sai

source: unrecognized arguments: %s
pt_br: argumentos desconhecidos: %s

source: not allowed with argument %s
pt_br: não permitido com argumento %s

source: ignored explicit argument %r
pt_br: argumento explícito ignorado %r

source: the following arguments are required: %s
pt_br: os argumentos a seguir são obrigatórios: %s

source: one of the arguments %s is required
pt_br: um dos argumentos %s é obrigatório

source: expected one argument
pt_br: esperado um argumento

source: expected at most one argument
pt_br: esperado no máximo um argumento

source: expected at least one argument
pt_br: esperado pelo menos um argumento

source: invalid choice: %(value)r (choose from %(choices)s)
pt_br: escolha inválida: %(value)r (escolha entre %(choices)s)

source: %(prog)s: error: %(message)s
pt_br: %(prog)s: erro: %(message)s
